[
	{
		"title": "Архитектура",
		"description": "Совокупность программных и аппаратных средств, составляющая информационную систему организации и включающая, в частности, базы данных и промежуточное программное обеспечение.",
		"reference": "Рыбальченко М. Архитектура информационных систем. Учебное пособие для СПО. – Litres, 2021."
	},
	{
		"title": "База данных",
		"description": "Имеющая название совокупность данных, которая отражает состояние объектов и их отношений в рассматриваемой предметной области.",
		"reference": "Таланов В. М., Рунков М. В., Ерофеев Г. В. Пример создания базы данных в системе управления базами данных MySQL //XLVI Огарёвские чтения. – 2018. – С. 219-224."
	},
	{
		"title": "Браузер",
		"description": "Прикладное программное обеспечение для просмотра страниц, содержания веб-документов, компьютерных файлов и их каталогов, управления веб-приложениями.",
		"reference": "Tim Berners-Lee: WorldWideWeb, the first Web client [Электронный ресурс]. URL: https://www.w3.org/People/Berners-Lee/WorldWideWeb.html (дата обращения: 23.01.2023)."
	},
	{
		"title": "Веб-клиент",
		"description": "Клиентская часть веб-приложения, представляющая себя одну или несколько веб-страниц и поддерживающая взаимодействие через браузер.",
		"reference": "Zero Client vs Thin Client vs Thick Clients: How to Pick The Right One | BizTech Magazine [Электронный ресурс]. URL: https://biztechmagazine.com/article/2018/10/thin-vs-thick-vs-zero-client-whats-right-fit-your-business-perfcon (дата обращения: 23.01.2023)."
	},
	{
		"title": "Веб-приложение",
		"description": "Клиент-серверное приложение, в котором клиент взаимодействует с веб-сервером при помощи браузера. Логика веб-приложения распределена между сервером и клиентом, хранение данных осуществляется, преимущественно, на сервере, обмен информацией происходит по сети.",
		"reference": "С. Пьюривал Основы разработки веб-приложений. - СПб.: Питер, 2019. - 272 с."
	},
	{
		"title": "Машинное обучение",
		"description": "Класс методов искусственного интеллекта, характерной чертой которых является не прямое решение задачи, а обучение за счёт применения решений множества сходных задач.",
		"reference": "Машинное обучение: просто о сложном [Электронный ресурс]. URL: https://sbercloud.ru/ru/warp/blog/machine-learning-about (дата обращения: 23.01.2023)."
	},
	{
		"title": "Микрофронтенд",
		"description": "Архитектурный подход, в котором несколько независимых приложений собираются в одно, позволяя упрощать разделение кодовой базы и параллельную работу нескольких команд над одним веб-приложением.",
		"reference": "ПРОКОФЬЕВ А. П. ОСОБЕННОСТИ АРХИТЕКТУРЫ МИКРОФРОНТЕНДОВ //ИННОВАЦИИ. – №. 50. – С. 2126-2132."
	},
	{
		"title": "Минификация",
		"description": "Процесс, направленный на уменьшение размера исходного кода путём удаления ненужных символов без изменения его функциональности.",
		"reference": "Гришан А. Приёмы минификации в веб-приложениях //Системный администратор. – 2009. – №. 4. – С. 74-79."
	},
	{
		"title": "Нейронная сеть",
		"description": "Математическая модель, а также её программное или аппаратное воплощение, построенная по принципу организации и функционирования биологических нейронных сетей — сетей нервных клеток живого организма. Искусственная нейронная сеть является разновидностью машинного обучения.",
		"reference": "Такмаков М. В. МАШИННОЕ ОБУЧЕНИЕ И НЕЙРОННЫЕ СЕТИ В КОММУНИКАЦИОННОЙ СФЕРЕ //Социальные коммуникации: наука, образование, профессия. – 2020. – №. 20. – С. 208-213."
	},
	{
		"title": "Рекомендательная система",
		"description": "Это комплекс сервисов и программ, который анализирует предпочтения пользователей и пытается предсказать, что может их заинтересовать",
		"reference": "Silveira T. et al. How good your recommender system is? A survey on evaluations in recommendation //International Journal of Machine Learning and Cybernetics. – 2019. – Т. 10. – №. 5. – С. 813-831. [Электронный ресурс]. URL: https://link.springer.com/article/10.1007/s13042-017-0762-9 (дата обращения: 23.01.2023)."
	},
	{
		"title": "API",
		"description": "Программный интерфейс взаимодействия приложений или программных компонентов между собой.",
		"reference": "Соленый С. В., Воропаев И. А., Давиденко М. Н. Об API и архитектурных методах защиты при его разработке //Волновая электроника и инфокоммуникационные системы. – 2022. – С. 251-256."
	},
	{
		"title": "Back-end",
		"description": "Программно-аппаратная часть сервиса. Это набор средств, с помощью которых происходит реализация логики веб-сайта, происходящая вне браузера пользователя и вне его компьютера.",
		"reference": "Smith P. G. Professional Website Performance: Optimizing the Front-End and Back-End. – John Wiley & Sons, 2018. [Электронный ресурс]. URL: https://books.google.com/books?hl=ru&lr=&id=MHLJlUfXV4QC&oi=fnd&pg=PR23&dq=Back-end+&ots=82Gri_LZFB&sig=Bk-WIiAmURSkKgS726_LHT6TKh8 (дата обращения: 23.01.2023)."
	},
	{
		"title": "Docker",
		"description": "Это проект с открытым исходным кодом для автоматизации развертывания приложений в виде переносимых автономных контейнеров, выполняемых в облаке или локальной среде.",
		"reference": "Docker [Электронный ресурс]. URL: https://docs.docker.com/get-started/overview/ (дата обращения: 23.01.2023)."
	},
	{
		"title": "Front-end",
		"description": "Практика преобразования данных в графический интерфейс с использованием HTML, CSS и JavaScript, чтобы пользователи могли просматривать эти данные и взаимодействовать с ними.",
		"reference": "Edkins A. et al. Exploring the front-end of project management //Engineering project organization journal. – 2013. – Т. 3. – №. 2. – С. 71-85. [Электронный ресурс]. URL: https://www.tandfonline.com/doi/pdf/10.1080/21573727.2013.775942  (дата обращения: 23.01.2023)."
	},
	{
		"title": "JavaScript",
		"description": "Мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Является реализацией спецификации ECMAScript.",
		"reference": "Wirfs-Brock A., Eich B. JavaScript: the first 20 years //Proceedings of the ACM on Programming Languages. – 2020. – Т. 4. – №. HOPL. – С. 1-189. [Электронный ресурс]. URL: https://link.springer.com/article/10.1186/s13321-020-0415-y (дата обращения: 23.01.2023)."
	},
	{
		"title": "JSON",
		"description": "Стандартный текстовый формат для представления структурированных данных на основе синтаксиса объекта JavaScript.",
		"reference": "Работа с JSON - Изучение веб-разработки - MDN Web Docs [Электронный ресурс]. URL: https://developer.mozilla.org/ru/docs/Learn/JavaScript/Objects/JSON (дата обращения: 23.01.2023)."
	},
	{
		"title": "LocalStorage",
		"description": "Свойство программного интерфейса веб-страницы, открывающее доступ к специальному объекту Storage (хранилище). Его используют для получения информации из локального хранилища. Данные хранятся там неограниченный период и могут быть удалены только при помощи JavaScript.",
		"reference": "Window.localStorage - Интерфейсы веб API - MDN Web Docs [Электронный ресурс]. URL: https://developer.mozilla.org/ru/docs/Web/API/Window/localStorage (дата обращения: 23.01.2023)."
	},
	{
		"title": "LSTM",
		"description": "Особая разновидность архитектуры рекуррентных нейронных сетей, способная к обучению долговременным зависимостям.",
		"reference": "Раббимов И.М., Кобилов С.С. Классификация мнений в тексте на основе LSTM архитектурной нейронной сети //Проблемы вычислительной и прикладной математики. Издание: 6. 2021. С. – 98-110. URL: https://www.elibrary.ru/item.asp?id=47919682 (дата обращения: 23.01.2023)."
	},
	{
		"title": "PostgreSQL",
		"description": "Объектно-реляционная система управления базами данных, имеющая открытый исходный код.",
		"reference": "PostgreSQL: The world’s most advances open source database [Электронный ресурс]. URL: https://www.postgresql.org/ (дата обращения: 23.01.2023)."
	},
	{
		"title": "Python",
		"description": "Язык программирования, который широко используется в интернет-приложениях, разработке программного обеспечения, науке о данных и машинном обучении (ML).",
		"reference": "Что такое Python? — Облачное руководство для начинающих по Python — AWS [Электронный ресурс]. URL: https://aws.amazon.com/ru/what-is/python/ (дата обращения: 23.01.2023)."
	},
	{
		"title": "WebAssembly",
		"description": "Низкоуровневый язык программирования, похожий на ассемблер, с компактным двоичным форматом, который работает с почти естественной производительностью, и поддержка исполнения которого реализована в современных браузерах. Может являться целью компиляции для низкоуровневых языков для обеспечения их работы на стороне веб-клиента.",
		"reference": "Haas A. et al. Bringing the web up to speed with WebAssembly //Proceedings of the 38th ACM SIGPLAN Conference on Programming Language Design and Implementation. – 2017. – С. 185-200."
	},
	{
		"title": "Web Workers",
		"description": "Механизм, который позволяет скрипту выполняться в фоновом потоке, который отделен от основного потока веб-приложения.",
		"reference": "Web Workers API - Интерфейсы веб API - MDN Web Docs [Электронный ресурс]. URL: https://developer.mozilla.org/ru/docs/Web/API/Web_Workers_API (дата обращения: 23.01.2023)."
	}
]